Revit 2026 API

# ElectricalLoadClassificationSpace Enumeration

---

This enum is used by the ElectricalLoadClassification to specify the load class for use with spaces.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ElectricalLoadClassificationSpace
```
```vb
Public Enumeration ElectricalLoadClassificationSpace
```
```cpp
public enum class ElectricalLoadClassificationSpace
```
```fsharp
type ElectricalLoadClassificationSpace
```

| Member name | Value | Description |
| --- | --- | --- |
| Lighting | 1 |  |
| None | 0 |  |
| Power | 2 |  |

#### Reference

Autodesk.Revit.DB.Electrical Namespace